thanhtra3105/UAV_Air_Quality_Monitor/fc_stm32/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
 ******************************************************************************
 * @file           : main.c
 * @brief          : Main program body
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2026 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 *
 * ======Body frame of DRONE========
 *
 *           +X (Front)
 ↑
 │
 -Y (Left) ◄──┼──► +Y (Right)
 │
 ▼
 Rear
 *
 *===== AXis of Optical Flow====
 *          Front
 ↑
 │
 Vy <0 │
 │
 Left ◄──────┼──────► Right
 Vx <0  │        Vx >0
 │
 Vy >0 │
 ▼
 Rear
 ******************************************************************************
 */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "nrf.h"
#include "icm20602.h"
#include "qmc5883.h"
#include "kalman.h"
#include "dwt.h"
#include "pid_controller.h"
#include "types.h"
#include <stdbool.h>
#include "uart_cmd.h"
#include "mtf01.h"
#include "tof.h"
#include "gps.h"
#include "pos_hold.h"
#include "ina219.h"
#include "dsp310.h"
#include "ist8310.h"
#include "kalman_position.h"
#include "kalman_gps.h"
#include "kalman.h"
#include "mission.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
//#define USE_QMC5883
#define USE_IST8310
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/

I2C_HandleTypeDef hi2c1;
I2C_HandleTypeDef hi2c2;
DMA_HandleTypeDef handle_GPDMA2_Channel0;

SPI_HandleTypeDef hspi1;
SPI_HandleTypeDef hspi2;

TIM_HandleTypeDef htim3;
TIM_HandleTypeDef htim6;

UART_HandleTypeDef huart4;
UART_HandleTypeDef huart7;
UART_HandleTypeDef huart1;
UART_HandleTypeDef huart2;
DMA_HandleTypeDef handle_GPDMA1_Channel1;
DMA_HandleTypeDef handle_GPDMA2_Channel1;
DMA_HandleTypeDef handle_GPDMA1_Channel0;

/* USER CODE BEGIN PV */

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_GPDMA1_Init(void);
static void MX_GPDMA2_Init(void);
static void MX_TIM3_Init(void);
static void MX_I2C1_Init(void);
static void MX_I2C2_Init(void);
static void MX_SPI1_Init(void);
static void MX_UART4_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_USART2_UART_Init(void);
static void MX_ICACHE_Init(void);
static void MX_UART7_Init(void);
static void MX_TIM6_Init(void);
static void MX_SPI2_Init(void);
/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

uint8_t address[5] = { '0', '0', '0', '0', '1' };

/* THÊM ĐOẠN NÀY LÊN PHÍA TRÊN MAIN HOẶC VÀO USER CODE BEGIN */
#pragma pack(push, 1)
typedef struct {
	uint16_t trucX;
	uint16_t trucY;
	uint8_t trai;
	uint8_t phai;
	uint8_t len;
	uint8_t xuong;
	uint8_t batquathut;
	uint8_t nut1;
	uint8_t nut2;
	uint16_t chinhtocdoquat;
	uint8_t has_wp;
	int32_t wp_lat;
	int32_t wp_lon;
} ControlData;

// Struct gửi Telemetry về tay cầm (Giống hệt Arduino)
typedef struct {
	int32_t lat;
	int32_t lon;
	float x;
	float y;
	float alt;
	float target_x;
	float target_y;
	float battery;
} TelemetryData;

#pragma pack(pop)

typedef enum {
	ALT_STATE_IDLE = 0, ALT_STATE_TAKEOFF, ALT_STATE_HOLD, ALT_STATE_LANDING
} AltHoldState_t;

AltHoldState_t alt_state = ALT_STATE_IDLE;

#define TAKEOFF_TARGET_ALT 500.0f  // Độ cao cất cánh mục tiêu (cm)
#define TAKEOFF_SPEED      100.0f  // Tốc độ cất cánh (m/s)
#define HOVER_THROTTLE_BASE 1400.0f
#define PILOT_TAKE_OFF_ALT  200.0f  // 2 mét (cm)
#define CLIMB_RATE          150.0f  // Tốc độ leo 1.5 m/s
#define DESCEND_RATE        100.0f  // Tốc độ hạ 1.0 m/s
#define DEADZONE_LOW        1300
#define DEADZONE_HIGH       1500

ControlData rxData;
TelemetryData txData;
QMC5883_t mag;
ICM20602_t imu;
GPS_Data_t gps;
Kalman2D_t kf;
MTF01_t mtf_data;
KalmanAxis_t kf_x;
KalmanAxis_t kf_y;
KalmanAxis_t kf_x_gps;
KalmanAxis_t kf_y_gps;
DSP310_t dsp_sensor;
Kalman4D_t kf_4d;
IST8310_Data_t ist8310;
KalmanPos_t kf_pos_x;
KalmanPos_t kf_pos_y;

KalmanFilter1D_t kf_North; // X Axis
KalmanFilter1D_t kf_East;  // Y Axis

float dt;
float gx, gy, gz;
float ax, ay, az;
float ax_offset = 0.0;
float ay_offset = 0.0;
float az_offset = 0.0;
float gx_offset = 0.0;
float gy_offset = 0.0;
float gz_offset = 0.0;

// ===== PID Parameters =====
PIDController_t PID_Angle;
PIDController_t PID_Rate_Pitch;
PIDController_t PID_Rate_Roll;
PIDController_t PID_Rate_Yaw;
PIDController_t PID_Alt;
PIDController_t PID_Alt_Pos;   // outer: vị trí -> target velocity
PIDController_t PID_Alt_Vel;   // inner: velocity -> throttle offset
// Thêm vào vùng khai báo biến toàn cục
PIDController_t PID_Pos_X;
PIDController_t PID_Pos_Y;
PIDController_t PID_Vel_X;
PIDController_t PID_Vel_Y;

// ===== PID ANGLE =====
float kp_angle = 6.5, ki_angle = 0, kd_angle = 0;
// ===== PID RATE =====
float kp_r = 0.85, ki_r = 1.0, kd_r = 0.003;
float kp_p = 0.85, ki_p = 1.0, kd_p = 0.003;
float kp_y = 0.85, ki_y = 0.0, kd_y = 0.003;
// ===== PID ALTITUDE ====
//float kp_alt_pos = 4.0, ki_alt_pos = 0.0f, kd_alt_pos = 0.0f;		// Use MTF01 TOF
//float kp_alt_vel = 0.8, ki_alt_vel = 0.0f, kd_alt_vel = 0.003f;
float kp_alt_pos = 1.0, ki_alt_pos = 0.0f, kd_alt_pos = 0.0f;	// Use DSP310
float kp_alt_vel = 0.8, ki_alt_vel = 0.0f, kd_alt_vel = 0.003f;
// ===== PID POSITION HOLD ====
/*==== MTF01 ====*/
//float kp_xy_pos = 1.2f, ki_xy_pos = 0.0f, kd_xy_pos = 0.0f; //
//float kp_xy_vel = 6.0f, ki_xy_vel = 0.1f, kd_xy_vel = 0.05f; //
/*===== GPS ====*/
float kp_xy_pos = 0.8f, ki_xy_pos = 0.0f, kd_xy_pos = 0.0f; //
float kp_xy_vel = 1.5f, ki_xy_vel = 0.0f, kd_xy_vel = 0.2f; //

