thanhtra3105/UAV_Air_Quality_Monitor/fc_stm32/Core/Src/main.c
// ===== TARGET ROLL/PITCH MAX/MIN =======
const float MAX_TARGET_ROLL_PITCH = 8.0;

// ================= MOTOR =================
int throttle = 1000;
int throttle_hover = 1000;

// ================= ANGLE =================
float roll = 0;
float pitch = 0;
float yaw = 0;

// ================= TARGET ANGLE =================
float target_pitch = 0; // độ (angle mode)
float target_roll = 0;
float target_yaw = 0;
// ================= TARGET RATE =================
float target_rate_pitch = 0;              // deg/s
float target_rate_roll = 0;
float target_rate_yaw = 0;

// ============= ALTITUDE=======================
float kp_alt = 3.0, ki_alt = 0.0, kd_alt = 0.5;
float target_alt;
float pid_alt = 0;
float target_vz = 0.0f;
uint8_t mtf01_updated = 0;	// flag mtf updated
const float MAX_TARGET_VZ = 80.0f;
const float MAX_ALT_OUTPUT = 200.0f;

// ===== DSP310 ======
float alt_offset = 0;

// ================= OUTPUT PID =================
float pid_p, pid_r, pid_y;
float pid_alt_vel_out = 0.0f;

float yaw_filt = 0;

/*========SAFE CONNECTED========*/
uint32_t timeout_connected = 0;
uint32_t time_throttle = 0;

uint8_t pid_flag = 0;
int distance = 0;
float vx = 0;
float vy = 0;
float current_alt;
uint8_t alt_hold = 0;
uint8_t alt_init = 0;

extern char gps_buffer[100];
extern volatile uint8_t gps_ready;
extern uint8_t rx_byte;

float time_dt = 0;

char raw_gps_buffer[120];
uint16_t raw_index = 0;
volatile uint8_t line_ready = 0;

//==== EST POSITION=====
#define FLOW_ALPHA     0.2f
#define KP_FLOW        0.25f
#define KI_FLOW        0.02f
#define KP_POS         0.10f

float ax_earth = 0.0f;
float ay_earth = 0.0f;

float ax_bias = 0.0f;
float ay_bias = 0.0f;

// Vận tốc ước lượng (Earth Frame)
float est_vx = 0.0f;
float est_vy = 0.0f;

// Vị trí ước lượng (Earth Frame) - m
float est_x = 0.0f;
float est_y = 0.0f;

// Điểm neo (Target)
#define MAX_TARGET_VEL_XY 1.0f  // m/s, tùy kích thước/độ nhạy drone của bạn
float target_x = 0.0f;
float target_y = 0.0f;

float target_vx = 0.0f;
float target_vy = 0.0f;

uint8_t pos_hold_active = 0; // Cờ trạng thái

uint8_t status = 0;
float ist_heading = 0.0f;

// === BIẾN CHO GPS POSITION HOLD ===
double home_lat = 0.0f;
double home_lon = 0.0f;
float gps_x = 0.0f, gps_y = 0.0f;
float last_gps_x = 0.0f, last_gps_y = 0.0f;
float gps_vx = 0.0f, gps_vy = 0.0f;
uint8_t gps_hold_active = 0;
uint8_t gps_home_set = 0;

static float acc_z_filt = 0.0f;

uint8_t dsp_rx_buf[6];
volatile uint8_t dsp_data_ready = 0;

uint8_t ina_rx_buf[2];
volatile uint8_t ina_data_ready = 0;

// Buffer chứa dữ liệu thô từ DMA
uint8_t rx_mission_buffer[MISSION_BUFFER_SIZE];

/*=====================LANDING====================*/
uint8_t landing_active = 0;
uint8_t landing_complete = 0;
#define LANDING_SPEED 40.0f  // Tốc độ hạ cánh (cm/s), có thể điều chỉnh

void Mode_AutoTakeoff(float);
void Mode_AutoLanding(float);

void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart) {
	if (huart->Instance == UART7) {
		UART_CMD_Process(&huart7);
//		GPS_UART_RxCallback(&huart1);
	}

	if (huart->Instance == USART2) {
		MTF01_Process(&huart2);
	}

//	GPS_UART_RxCallback(&huart1);
//	if (huart->Instance == USART1) {
//		// CHÌA KHÓA Ở ĐÂY: Chỉ cho phép lưu data khi mảng đang rảnh (line_ready == 0)
//		if (line_ready == 0) {
//			raw_gps_buffer[raw_index++] = rx_byte;
//
//			// Nếu gặp ký tự xuống dòng hoặc mảng sắp tràn
//			if (rx_byte == '\n' || raw_index >= 119) {
//				raw_gps_buffer[raw_index] = '\0'; // Chốt chuỗi
//				line_ready = 1;             // Khóa mảng lại, báo cho main xử lý
//			}
//		}
//
//		// Vẫn phải mồi lại ngắt (dù có lưu vào mảng hay không) để tránh ORE
//		HAL_UART_Receive_IT(&huart1, &rx_byte, 1);
//	}
}
int counttt = 0;
// Hàm Callback mặc định của HAL cho sự kiện Receive To IDLE
void HAL_UARTEx_RxEventCallback(UART_HandleTypeDef *huart, uint16_t Size) {
	// Đẩy sự kiện sang cho hàm xử lý của ta bên file gps.c
	GPS_UART_RxEventCallback(huart, Size);
	if (huart->Instance == UART7) // Đã chuyển sang UART7
	{
		counttt++;
		// Đẩy phần dữ liệu vừa nhận được vào module xử lý Mission
		Mission_ParseChunk(rx_mission_buffer, Size);

		// Khởi động lại DMA để tiếp tục đón mẻ dữ liệu mới từ ESP32
		HAL_UARTEx_ReceiveToIdle_DMA(&huart7, rx_mission_buffer,
		MISSION_BUFFER_SIZE);
	}
}

void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim) {
	if (htim->Instance == TIM6) {
		pid_flag = 1;
	}

}

// Callback khi nhận thành công qua I2C Interrupt
void HAL_I2C_MemRxCpltCallback(I2C_HandleTypeDef *hi2c) {
	DSP310_I2C_MemRxCpltCallback(hi2c);
}

// Hàm cực kỳ quan trọng để chống giật/rơi máy bay khi lỏng dây
void HAL_I2C_ErrorCallback(I2C_HandleTypeDef *hi2c) {
	// Nếu có lỗi (như lỏng dây, mất ACK), ta reset lại khối I2C đó
//	HAL_I2C_DeInit(hi2c);
//	HAL_I2C_Init(hi2c);
	DSP310_I2C_ErrorCallback(hi2c);
}

long map(long x, long in_min, long in_max, long out_min, long out_max) {
	return (x - in_min) * (out_max - out_min) / (in_max - in_min) + out_min;
}

float constrain(float data, float min, float max) {
	if (data <= min)
		return min;
	if (data >= max)
		return max;
	return data;
}
void writeMotor(uint8_t chanel, int16_t us) {
	__HAL_TIM_SET_COMPARE(&htim3, chanel, us);
}

void Failsafe_Task(void) {
	if (HAL_GetTick() - timeout_connected > 1000) {
		alt_hold = false;

		if (HAL_GetTick() - time_throttle > 400) {
			if (throttle > 1200) {
				throttle -= 5;
				time_throttle = HAL_GetTick();
			} else {
				if (kf_4d.velocity < 10.0)	// velocity < 10cm/s
					throttle = 1000;
			}
//			Mode_AutoLanding(0.002);
		}
	}
}

float target_pitch_body = 0.0f, target_roll_body = 0.0f;
void RxController() {
	if (NRF24_Available()) {
		uint8_t len = NRF24_GetDynamicPayloadSize();

		if (len == sizeof(ControlData)) {
			NRF24_Read((uint8_t*) &rxData, len);
			throttle = rxData.chinhtocdoquat;
			bool poshold_active = rxData.nut1 && rxData.nut2;

			if (!poshold_active) {
				target_roll = (float) map(rxData.trucX, 0, 100,
						(long) MAX_TARGET_ROLL_PITCH,
						(long) -MAX_TARGET_ROLL_PITCH);
				target_pitch = (float) map(rxData.trucY, 0, 100,
						(long) MAX_TARGET_ROLL_PITCH,
						(long) -MAX_TARGET_ROLL_PITCH);
			}
			alt_hold = rxData.nut1;
			timeout_connected = HAL_GetTick();
		}
		txData.lat = (int32_t) (gps.latitude * 1e7);
		txData.lon = (int32_t) (gps.longitude * 1e7);
		txData.x = est_x;
		txData.y = est_y;
		txData.alt = kf_4d.altitude;
		NRF24_WriteAckPayload(0, &txData, sizeof(TelemetryData));

	} else {
		Failsafe_Task();
	}
}

