thanhtra3105/UAV_Air_Quality_Monitor/fc_stm32/Core/Src/main.c
}

void Estimate_Position(float dt) {
	/*=============================
	 Rotation Body -> Earth
	 =============================*/
	float cy = cosf(yaw * DEG_TO_RAD);
	float sy = sinf(yaw * DEG_TO_RAD);
//	float cy = 1.0f;
//	float sy = 0.0f;
	float cp = cosf(pitch * DEG_TO_RAD);
	float sp = sinf(pitch * DEG_TO_RAD);
	float cr = cosf(roll * DEG_TO_RAD);
	float sr = sinf(roll * DEG_TO_RAD);

	ax_earth = cy * cp * ax + (cy * sp * sr - sy * cr) * ay
			+ (cy * sp * cr + sy * sr) * az;

	ay_earth = sy * cp * ax + (sy * sp * sr + cy * cr) * ay
			+ (sy * sp * cr - cy * sr) * az;

	ax_earth *= 9.81f;
	ay_earth *= 9.81f;

	/*=============================
	 Optical Flow -> Earth
	 =============================*/
	float body_vx = -mtf_data.vy; // Tiến/Lùi
	float body_vy = mtf_data.vx;  // Trái/Phải

	float flow_vx = body_vx * cy - body_vy * sy;
	float flow_vy = body_vx * sy + body_vy * cy;

	/*=============================
	 Low Pass Filter cho Flow
	 =============================*/
	static float flow_vx_lp = 0.0f;
	static float flow_vy_lp = 0.0f;

	flow_vx_lp += FLOW_ALPHA * (flow_vx - flow_vx_lp);
	flow_vy_lp += FLOW_ALPHA * (flow_vy - flow_vy_lp);

	/*=============================
	 Prediction (IMU)
	 =============================*/
	float ax_correct = ax_earth - ax_bias;
	float ay_correct = ay_earth - ay_bias;

	est_vx += ax_correct * dt;
	est_vy += ay_correct * dt;

	/*=============================
	 Correction (Optical Flow)
	 =============================*/
	// Cần > 100mm (10cm) để tránh Ground Effect
	if (mtf_data.flow_quality > 50 && mtf_data.distance >= 100) {
		float err_vx = flow_vx_lp - est_vx;
		float err_vy = flow_vy_lp - est_vy;

		ax_bias += KI_FLOW * err_vx * dt;
		ay_bias += KI_FLOW * err_vy * dt;

		est_vx += KP_FLOW * err_vx;
		est_vy += KP_FLOW * err_vy;
	}

	/*=============================
	 Integrate Position
	 =============================*/
	est_x += est_vx * dt;
	est_y += est_vy * dt;
}

void positionHold(float dt) {		// MTF01
	uint8_t pos_hold_sw = rxData.nut2;

	if (pos_hold_sw && alt_hold) {
		if (!pos_hold_active) {
			target_x = est_x;
			target_y = est_y;
			PID_Reset(&PID_Pos_X);
			PID_Reset(&PID_Pos_Y);
			PID_Reset(&PID_Vel_X);
			PID_Reset(&PID_Vel_Y);
			pos_hold_active = 1;
		}
		// ====== POSITION LOOP=====
		float err_x = target_x - est_x;
		float err_y = target_y - est_y;
		target_vx = PID_Calculate(&PID_Pos_X, err_x, dt);
		target_vy = PID_Calculate(&PID_Pos_Y, err_y, dt);

		target_vx = constrain(target_vx, -MAX_TARGET_VEL_XY, MAX_TARGET_VEL_XY);
		target_vy = constrain(target_vy, -MAX_TARGET_VEL_XY, MAX_TARGET_VEL_XY);

		// ==== VELOCITY X,Y LOOP=====
		float err_vx = target_vx - est_vx;
		float err_vy = target_vy - est_vy;

		// 1. Góc nghiêng (hoặc Lực đẩy) cần thiết trên hệ tọa độ Trái Đất
		float out_angle_earth_x = PID_Calculate(&PID_Vel_X, err_vx, dt);
		float out_angle_earth_y = PID_Calculate(&PID_Vel_Y, err_vy, dt);

		// 2. ĐẢO DẤU TẠI ĐÂY NẾU TRỤC BỊ NGƯỢC CHIỀU
		// Chuyển dấu trừ từ target_pitch lên đây!
		out_angle_earth_x = -out_angle_earth_x;

		// (Ghi chú: Nếu Roll của bạn cũng bị ngược thì thêm dấu trừ vào dòng dưới)
		// out_angle_earth_y = -out_angle_earth_y;

		// 3. VÒNG ROTATION (Xoay từ Earth -> Body)
		float cy = cosf(yaw * DEG_TO_RAD);
		float sy = sinf(yaw * DEG_TO_RAD);

		// Hàm xoay toán học nguyên bản, tuyệt đối không chèn thêm dấu ở đây
		target_pitch_body = out_angle_earth_x * cy + out_angle_earth_y * sy;
		target_roll_body = -out_angle_earth_x * sy + out_angle_earth_y * cy;

		// 4. Giới hạn góc nghiêng tối đa
		target_pitch_body = constrain(target_pitch_body, -15.0f, 15.0f);
		target_roll_body = constrain(target_roll_body, -15.0f, 15.0f);

		// 5. GÁN TRỰC TIẾP, KHÔNG CÒN DẤU TRỪ NÀO NỮA
		target_pitch = target_pitch_body;
		target_roll = target_roll_body;
	} else {
		// Tắt Pos Hold
		if (pos_hold_active) {
			pos_hold_active = 0;
			// Trả lại target_pitch và target_roll cho tay cầm (RC)
		}
	}
}

#define GPS_POS_R      2.5f
#define KI_GPS_BIAS    0.02f   // hệ số học bias — BẮT ĐẦU NHỎ, tune tăng dần
#define MAX_ACCEL_BIAS 1.0f    // m/s^2, chặn để tránh runaway khi GPS jump/nhiễu

float lat_err, lon_err;
float pos_N, pos_E;
void Estimate_Position_GPS_Kalman(float dt) {
	/*=============================
	 1. Xoay gia tốc từ Body -> Earth Frame
	 =============================*/
	/* Covert FLU to FRD*/
	float ax_frd = ax;
	float ay_frd = -ay;
	float az_frd = -az;

	float cy = cosf(yaw * DEG_TO_RAD);
	float sy = sinf(yaw * DEG_TO_RAD);

	float cp = cosf(pitch * DEG_TO_RAD);
	float sp = sinf(pitch * DEG_TO_RAD);

	float cr = cosf(roll * DEG_TO_RAD);
	float sr = sinf(roll * DEG_TO_RAD);
	/*========================================
	 * FRD -> NED
	 *========================================*/

	ax_earth = cy * cp * ax_frd + (-cy * sp * sr - sy * cr) * ay_frd
			+ (-cy * sp * cr + sy * sr) * az_frd;

	ay_earth = sy * cp * ax_frd + (-sy * sp * sr + cy * cr) * ay_frd
			+ (-sy * sp * cr - cy * sr) * az_frd;

	/* g -> m/s² */
	ax_earth *= 9.81f;
	ay_earth *= 9.81f;

	/*=============================
	 2. Kalman PREDICT (500Hz - IMU)
	 =============================*/
	KalmanGPS_Predict(&kf_North, ax_earth, dt);
	KalmanGPS_Predict(&kf_East, ay_earth, dt);

	/*=============================
	 3. Kalman UPDATE (Chạy ~10Hz bằng GPS)
	 =============================*/
	if (gps.fixType >= 3 && gps.ready == 1) {
		if (!gps_home_set) {
			home_lat = gps.latitude;
			home_lon = gps.longitude;
			gps_home_set = 1;

			// Reset trạng thái
			kf_North.pos = 0.0f;
			kf_North.vel = 0.0f;
			kf_North.bias = 0.0f;
			kf_East.pos = 0.0f;
			kf_East.vel = 0.0f;
			kf_East.bias = 0.0f;

		} else {
			lat_err = (float) gps.latitude - home_lat;
			lon_err = (float) gps.longitude - home_lon;

			pos_N = lat_err * 111320.0f;
			pos_E = lon_err * 111320.0f * cosf(home_lat * DEG_TO_RAD);

			float vel_N = (float) gps.velN / 1000.0f;
			float vel_E = (float) gps.velE / 1000.0f;

			// Bình phương biến số sai số GPS để làm nhiễu (Ví dụ pAcc báo sai số 1.5m -> r = 1.5*1.5)
			float r_pos_noise = (float) (gps.hAcc / 1000.0f)
					* (gps.hAcc / 1000.0f);
			float r_vel_noise = (float) (gps.sAcc / 1000.0f)
					* (gps.sAcc / 1000.0f);

