thanhtra3105/UAV_Air_Quality_Monitor/fc_stm32/Core/Src/main.c
			KalmanGPS_Update(&kf_North, pos_N, vel_N, r_pos_noise, r_vel_noise);
			KalmanGPS_Update(&kf_East, pos_E, vel_E, r_pos_noise, r_vel_noise);
		}
		gps.ready = 0;
	}

	/* 4. Gán State cho hàm PID Position Hold */
	est_x = kf_North.pos;
	est_vx = kf_North.vel;
	est_y = kf_East.pos;
	est_vy = kf_East.vel;
}

float err_x, err_y;
uint16_t current_wp_index = 0;
uint8_t mission_running = 0;
#define WAYPOINT_RADIUS 2.0f // Bán kính 2 mét để xác nhận đã đến điểm

#define MAX_NAV_SPEED 5.0f // Tốc độ di chuyển tối đa của máy bay (m/s)

//// Hàm dùng chung cho mọi chế độ bay cần bám theo Cà Rốt ngang
void Run_XY_Controller(float dt) {
	// Khâu PID bám theo Cà Rốt
	float err_x = target_x - est_x;
	float err_y = target_y - est_y;

	target_vx = PID_Calculate(&PID_Pos_X, err_x, dt);
	target_vy = PID_Calculate(&PID_Pos_Y, err_y, dt);

	/* CONSTRAIN Vận tốc: Phải lớn hơn MAX_NAV_SPEED 1 chút (Vd: +1.0m/s)
	 Để máy bay có khả năng tăng tốc đuổi kịp Cà rốt khi bị gió cản */
	target_vx = constrain(target_vx, -MAX_NAV_SPEED - 1.0f,
	MAX_NAV_SPEED + 1.0f);
	target_vy = constrain(target_vy, -MAX_NAV_SPEED - 1.0f,
	MAX_NAV_SPEED + 1.0f);

	// ==== VELOCITY X,Y LOOP=====
	float err_vx = target_vx - est_vx;
	float err_vy = target_vy - est_vy;

	// 1. Tính toán lực đẩy cần thiết trên hệ tọa độ Trái Đất (X=North, Y=East)
	float out_angle_earth_x = PID_Calculate(&PID_Vel_X, err_vx, dt);
	float out_angle_earth_y = PID_Calculate(&PID_Vel_Y, err_vy, dt);

	// 2. VÒNG ROTATION (Xoay từ Earth -> Body)
	float cy = cosf(yaw * DEG_TO_RAD);
	float sy = sinf(yaw * DEG_TO_RAD);

	float force_body_x = out_angle_earth_x * cy + out_angle_earth_y * sy;
	float force_body_y = -out_angle_earth_x * sy + out_angle_earth_y * cy;

	// 3. Giới hạn góc nghiêng/lực tối đa
	// LƯU Ý MỚI: Nếu bạn bay ở 5m/s, bạn PHẢI NỚI GÓC NÀY LÊN 20 ĐỘ.
	// Nếu để 10 độ, nó sẽ không có đủ lực cản không khí để phanh đâu!
	force_body_x = constrain(force_body_x, -20.0f, 20.0f);
	force_body_y = constrain(force_body_y, -20.0f, 20.0f);

	// 4. MAPPING TRỰC TIẾP LÊN TRỤC CỦA DRONE
	// Tiến = Pitch Dương, Phải = Roll Dương
	target_pitch = force_body_x;
	target_roll = force_body_y;
}

void GPS_PositionHold(float dt) {		// GPS pos hold
	uint8_t gps_hold_sw = rxData.nut2;

//	 Yêu cầu phải bật công tắc, có sóng GPS và đã chốt Home
	if (rxData.nut1 && gps_hold_sw && gps_home_set) {
		if (!pos_hold_active) {
			target_x = est_x; // Khởi tạo Cà Rốt ngay tại bụng máy bay
			target_y = est_y;

			current_wp_index = 0;

			if (Mission_IsReady() && Mission_GetCount() > 0) {
				mission_running = 1;
			} else {
				mission_running = 0;
			}

			PID_Reset(&PID_Pos_X);
			PID_Reset(&PID_Pos_Y);
			PID_Reset(&PID_Vel_X);
			PID_Reset(&PID_Vel_Y);
			pos_hold_active = 1;
		}

		if (mission_running) {
			Waypoint_t current_wp = Mission_GetWaypoint(current_wp_index);

			// Quy đổi tọa độ Waypoint sang hệ mét (Đích đến)
			float wp_lat_err = (float) current_wp.lat - home_lat;
			float wp_lon_err = (float) current_wp.lon - home_lon;
			float wp_target_x = wp_lat_err * 111320.0f;
			float wp_target_y = wp_lon_err * 111320.0f
					* cosf(home_lat * DEG_TO_RAD);

			/* ==============================================================
			 * THUẬT TOÁN S-CURVE (CARROT CHASING) THAY THẾ CHO GÁN TRỰC TIẾP
			 * ============================================================== */
			// Tính khoảng cách từ Cà rốt hiện tại đến Đích
			float dx_carrot = wp_target_x - target_x;
			float dy_carrot = wp_target_y - target_y;
			float dist_carrot_to_wp = sqrtf(
					dx_carrot * dx_carrot + dy_carrot * dy_carrot);

			// Nếu cà rốt chưa tới Đích thì đẩy nó đi tiếp
			if (dist_carrot_to_wp > 0.05f) {
				float dir_x = dx_carrot / dist_carrot_to_wp;
				float dir_y = dy_carrot / dist_carrot_to_wp;

				float current_speed = MAX_NAV_SPEED;

				// Phanh mềm S-Curve: Khi cách đích dưới 3 mét, đi chậm lại
				if (dist_carrot_to_wp < 2.0f) {
					current_speed = dist_carrot_to_wp * 2.5f;
					if (current_speed < 0.2f)
						current_speed = 0.2f;
				}

				// Đẩy cà rốt tiến tới 1 bước ngắn theo dt
				target_x += dir_x * current_speed * dt;
				target_y += dir_y * current_speed * dt;
			}
			// (ĐÃ XÓA DÒNG target_x = wp_target_x CỦA BẠN ĐI ĐỂ TRÁNH GIẬT CỤC)
			/* ============================================================== */

			// Tính khoảng cách từ DRONE (Máy bay thật) đến Waypoint
			float dx_drone = wp_target_x - est_x;
			float dy_drone = wp_target_y - est_y;
			float dist_to_wp = sqrtf(dx_drone * dx_drone + dy_drone * dy_drone);

			// Nếu Drone đã bay lọt vào bán kính Waypoint
			if (dist_to_wp < WAYPOINT_RADIUS) {
				if (current_wp_index < Mission_GetCount() - 1) {
					current_wp_index++; // Chuyển mục tiêu
				}
			}
		}
		Run_XY_Controller(dt);
		txData.target_x = target_roll;
		txData.target_y = target_pitch;
	} else {
		if (pos_hold_active) {
			pos_hold_active = 0;
			mission_running = 0;
		}
	}
}

uint8_t takeoff_active = 0;
uint8_t takeoff_complete = 0;

void Mode_AutoTakeoff(float dt) {
	if (rxData.nut1 && gps_home_set) {
		if (!takeoff_active) {
			target_x = est_x; // Giữ máy bay không trượt ngang
			target_y = est_y;
			target_alt = kf_4d.altitude; // Bắt đầu từ mặt đất

			PID_Reset(&PID_Pos_X);
			PID_Reset(&PID_Pos_Y);
			PID_Reset(&PID_Vel_X);
			PID_Reset(&PID_Vel_Y);
			PID_Reset(&PID_Alt_Pos);
			PID_Reset(&PID_Alt_Vel);
			takeoff_active = 1;
			takeoff_complete = 0;
		}

		if (!takeoff_complete) {
			target_alt += TAKEOFF_SPEED * dt;
			if (target_alt >= TAKEOFF_TARGET_ALT) {
				target_alt = TAKEOFF_TARGET_ALT;
				if (abs(target_alt - kf_4d.altitude) < 20)		// sai so 20cm
					takeoff_complete = 1;
			}
		}

		// GỌI LẠI HÀM GIỮ VỊ TRÍ NGANG ĐỂ KHÔNG BỊ TRÔI!
		Run_XY_Controller(dt);

		// VÀ BỒI THÊM VÒNG LẶP ĐỘ CAO (Z)
		float err_z = target_alt - kf_4d.altitude;
		target_vz = constrain(PID_Calculate(&PID_Alt_Pos, err_z, dt), -2.0f,
				2.0f);

		float err_vz = target_vz - kf_4d.velocity;
		throttle_hover = HOVER_THROTTLE_BASE
				+ PID_Calculate(&PID_Alt_Vel, err_vz, dt);

	} else {
		takeoff_active = 0;
	}
}

void Mode_AutoLanding(float dt) {
	if(!landing_active) {
		target_x = est_x;
		target_y = est_y;

		target_alt = kf_4d.altitude;

		// Reset các bộ PID để tránh hiện tượng giật cục do tích lũy lỗi
		PID_Reset(&PID_Pos_X);
		PID_Reset(&PID_Pos_Y);
		PID_Reset(&PID_Vel_X);
		PID_Reset(&PID_Vel_Y);
		PID_Reset(&PID_Alt_Pos);
		PID_Reset(&PID_Alt_Vel);

		landing_active = 1;
		landing_complete = 0;
	}
	if (!landing_complete) {
		// Giảm dần độ cao mục tiêu theo thời gian
		target_alt -= LANDING_SPEED * dt;

