thanhtra3105/UAV_Air_Quality_Monitor/fc_stm32/Core/Src/main.c
void calcualatePIDRate(float dt_rate) {
//  ================= PID RATE =================
	float pitch_rate_err = target_rate_pitch - gy;
	pid_p = PID_Calculate(&PID_Rate_Pitch, pitch_rate_err, dt_rate);

	float roll_rate_err = target_rate_roll - gx;
	pid_r = PID_Calculate(&PID_Rate_Roll, roll_rate_err, dt_rate);

	float yaw_rate_err = target_rate_yaw - gz;
	pid_y = PID_Calculate(&PID_Rate_Yaw, yaw_rate_err, dt_rate);

	if (alt_hold) {
//		float vz_err = target_vz - kf.velocity;	// tof
		float vz_err = target_vz - kf_4d.velocity;
		pid_alt_vel_out = PID_Calculate(&PID_Alt_Vel, vz_err, dt_rate);
		pid_alt = pid_alt_vel_out;
	} else {
		pid_alt = 0;
		PID_Reset(&PID_Alt_Vel);
	}
//	if (alt_hold) {
//		float vz_err = target_vz - kf_4d.velocity;
//		pid_alt_vel_out = PID_Calculate(&PID_Alt_Vel, vz_err, dt_rate);
//
//		// MẤU CHỐT: Triệt tiêu throttle vật lý, xoay quanh HOVER base
//		pid_alt = HOVER_THROTTLE_BASE + pid_alt_vel_out - throttle;
//	} else {
//		pid_alt = 0;
//		PID_Reset(&PID_Alt_Vel);
//	}

	pid_r = constrain(pid_r, -300, 300);
	pid_p = constrain(pid_p, -300, 300);
	pid_y = constrain(pid_y, -300, 300);
	pid_alt = constrain(pid_alt, -MAX_ALT_OUTPUT, MAX_ALT_OUTPUT);

}

int sp1, sp2, sp3, sp4;
void mixer() {
	int m1 = (int) (float) throttle - pid_p - pid_r - pid_y + pid_alt ;
	int m2 = (int) (float) throttle + pid_p - pid_r + pid_y + pid_alt;
	int m3 = (int) (float) throttle + pid_p + pid_r - pid_y + pid_alt;
	int m4 = (int) (float) throttle - pid_p + pid_r + pid_y + pid_alt;

//	int m1 = (int) (float) throttle - pid_r;
//	int m2 = (int) (float) throttle - pid_r;
//	int m3 = (int) (float) throttle + pid_r;
//	int m4 = (int) (float) throttle + pid_r;

	if (throttle > 1040) {
		writeMotor(M1, m1);
		writeMotor(M2, m2);
		writeMotor(M3, m3);
		writeMotor(M4, m4);
	} else {
		writeMotor(M1, 1000);
		writeMotor(M2, 1000);
		writeMotor(M3, 1000);
		writeMotor(M4, 1000);
	}
}

static uint8_t angle_div = 0;

void PID_Task(float dt_pid) {
	if (++angle_div >= 2) {
		angle_div = 0;
		calculatePIDAngle(dt_pid * 2);      // 250 Hz
//		distance = readTOF(&hi2c1);
	}
	calcualatePIDRate(dt_pid);          // 500 Hz
}

void calibIMU() {
//	for (int i = 0; i < 500; i++) {
//		ICM20602_Read(&imu);
//		ax_offset += imu.accel.x;
//		ay_offset += imu.accel.y;
//		az_offset += imu.accel.z;
//
//		gx_offset += imu.gyro.x;
//		gy_offset += imu.gyro.y;
//		gz_offset += imu.gyro.z;
//	}
//	ax_offset = (ax_offset / 500);
//	ay_offset = (ay_offset / 500);
//	az_offset = (az_offset / 500);
//	gx_offset = (gx_offset / 500);
//	gy_offset = (gy_offset / 500);
//	gz_offset = (gz_offset / 500);

	ax_offset = -0.0146474605;
	ay_offset = -0.020620605;
	az_offset = 0.980093241;
	gx_offset = 0.379269421;
	gy_offset = -0.210610926;
	gz_offset = 0.219878733;
}

float DSP_CalibrationAltitude(uint8_t sample) {
	float h = 0;
	for (int i = 0; i < sample; i++) {
		// Dùng vòng lặp while để "giam" chương trình lại
		// cho đến khi hàm Read trả về 1 (DMA lấy xong dữ liệu)
		while (!DSP310_Read(&dsp_sensor)) {
			HAL_Delay(1); // Cho CPU thở 1ms trong lúc chờ DMA
		}

		h += dsp_sensor.altitude;
		HAL_Delay(60); // Cảm biến chạy ở 16Hz (62.5ms/mẫu), nên chờ 60ms cho mẫu tiếp theo
	}
	return (float) h / sample;
}

/* USER CODE END 0 */

/**
 * @brief  The application entry point.
 * @retval int
 */
int main(void) {

	/* USER CODE BEGIN 1 */

	/* USER CODE END 1 */

	/* MCU Configuration--------------------------------------------------------*/

	/* Reset of all peripherals, Initializes the Flash interface and the Systick. */
	HAL_Init();

	/* USER CODE BEGIN Init */

	/* USER CODE END Init */

	/* Configure the system clock */
	SystemClock_Config();

	/* USER CODE BEGIN SysInit */

	/* USER CODE END SysInit */

	/* Initialize all configured peripherals */
	MX_GPIO_Init();
	MX_GPDMA1_Init();
	MX_GPDMA2_Init();
	MX_TIM3_Init();
	MX_I2C1_Init();
	MX_I2C2_Init();
	MX_SPI1_Init();
	MX_UART4_Init();
	MX_USART1_UART_Init();
	MX_USART2_UART_Init();
	MX_ICACHE_Init();
	MX_UART7_Init();
	MX_TIM6_Init();
	MX_SPI2_Init();
	/* USER CODE BEGIN 2 */
	HAL_TIM_PWM_Init(&htim3);
	HAL_TIM_PWM_Start(&htim3, TIM_CHANNEL_1);
	HAL_TIM_PWM_Start(&htim3, TIM_CHANNEL_2);
	HAL_TIM_PWM_Start(&htim3, TIM_CHANNEL_3);
	HAL_TIM_PWM_Start(&htim3, TIM_CHANNEL_4);

	HAL_TIM_Base_Start_IT(&htim6);

//	HAL_UART_Init(&huart7);
//	Serial_Init(&huart1, 115200);
//	UART_Command_Init(&huart7);
//	MTF01_Init(&mtf01_handle, &huart2);
//	GPS_Init(&huart1);
	GPS_Init_DMA(&huart1);
	MTF01_Init(&huart2);

	HAL_I2C_Init(&hi2c1);
	HAL_I2C_Init(&hi2c2);
#ifdef USE_QMC5883
	QMC5883_Init(&hi2c2, &mag, 0x00, 0x01, 0x03, 0x01);
#else
	IST8310_Init(&hi2c2, &ist8310);
#endif
	HAL_SPI_Init(&hspi1);
	HAL_SPI_Init(&hspi2);
	ICM_CS_HIGH();
	NRF_CSN_HIGH();
	HAL_Delay(10);

	NRF24_Init();
	NRF24_OpenReadingPipe(0, address);
	NRF24_StartListening();

	HAL_Delay(500);
	DWT_Init();

	ICM20602_Init();
	mag.declination = 0;

	INA219_Init(&hi2c2);

	PID_Init(&PID_Angle, kp_angle, ki_angle, kd_angle, 0.2);
	PID_Init(&PID_Rate_Pitch, kp_p, ki_p, kd_p, 0.2);
	PID_SetIntegralLimits(&PID_Rate_Pitch, -60.0f, 60.0f);
	PID_Init(&PID_Rate_Roll, kp_r, ki_r, kd_r, 0.2);
	PID_SetIntegralLimits(&PID_Rate_Roll, -60.0f, 60.0f);
	PID_Init(&PID_Rate_Yaw, kp_y, ki_y, kd_y, 0.2);

	PID_Init(&PID_Alt, kp_alt, ki_alt, kd_alt, 0.2);
	PID_Init(&PID_Alt_Pos, kp_alt_pos, ki_alt_pos, kd_alt_pos, 0.2);
	PID_Init(&PID_Alt_Vel, kp_alt_vel, ki_alt_vel, kd_alt_vel, 0.2);
	PID_SetIntegralLimits(&PID_Alt_Vel, -40.0f, 40.0f);

	PID_Init(&PID_Pos_X, kp_xy_pos, ki_xy_pos, kd_xy_pos, 0.2);
	PID_Init(&PID_Pos_Y, kp_xy_pos, ki_xy_pos, kd_xy_pos, 0.2);

	PID_Init(&PID_Vel_X, kp_xy_vel, ki_xy_vel, kd_xy_vel, 0.2);
	PID_SetIntegralLimits(&PID_Vel_X, -6.0f, 6.0f); // 40% of 15deg
	PID_Init(&PID_Vel_Y, kp_xy_vel, ki_xy_vel, kd_xy_vel, 0.2);
	PID_SetIntegralLimits(&PID_Vel_Y, -6.0f, 6.0f);

	Kalman2D_Init(&kf, 16);
	KalmanAxis_Init(&kf_x);
	KalmanAxis_Init(&kf_y);
	KalmanAxis_Init(&kf_x_gps);
	KalmanAxis_Init(&kf_y_gps);

	KalmanPos_Init(&kf_pos_x, 0.004f, 0.05f, 1.5f);
	KalmanPos_Init(&kf_pos_y, 0.004f, 0.05f, 1.5f);

	KalmanGPS_Init(&kf_North, 0.0f, 0.0f, 0.1f, 0.001f);
	KalmanGPS_Init(&kf_East, 0.0f, 0.0f, 0.1f, 0.001f);

	Mission_Init();
	HAL_UARTEx_ReceiveToIdle_DMA(&huart7, rx_mission_buffer,
	MISSION_BUFFER_SIZE);

	if (!DSP310_Init(&dsp_sensor, &hi2c1)) {
		Serial_printf(&huart1, "DSP Init Failed!\r\n");
	} else
		Serial_printf(&huart1, "[OK] DSP Init Successful!\r\n");

	alt_offset = DSP_CalibrationAltitude(10);	// Lấy 10 sample
	// ĐỢI đến khi lấy được 1 mẫu hợp lệ thì mới khởi tạo Kalman
	while (!DSP310_Read(&dsp_sensor)) {
		HAL_Delay(1);
	}
	float h = dsp_sensor.altitude;
	Kalman4D_Init(&kf_4d, h - alt_offset);

