thanhtra3105/UAV_Air_Quality_Monitor/fc_stm32/Core/Src/main.c
	calibIMU();

	bool yaw_hold_init = false;

	Serial_printf(&huart1, "[WAITING] Waiting pull throttle to 0!\r\n");
	while (1) {
		if (NRF24_Available()) {
			uint8_t len = NRF24_GetDynamicPayloadSize();
			if (len == sizeof(ControlData)) {
				NRF24_Read((uint8_t*) &rxData, len);
				if (rxData.chinhtocdoquat == 1000)
					break;
			}
		}
	}
//	NRF24_WriteAckPayload(0, &txData, sizeof(TelemetryData));		// thong bao da ket noi thanh cong voi tx

	uint32_t ina219_timer = 0;
	uint32_t esp_timer = 0;
	Serial_printf(&huart1, "[OK] START\r\n");
	/* USER CODE END 2 */

	/* Infinite loop */
	/* USER CODE BEGIN WHILE */
	while (1) {
		/* USER CODE END WHILE */

		/* USER CODE BEGIN 3 */
		uint32_t start = DWT_GetMicros();
//		uint32_t time_get = HAL_GetTick();
		dt = 0.002f;
		RxController();
		if (!yaw_hold_init && throttle > 1030) {
			target_yaw = yaw;
			// home_position = gpsRead();
			yaw_hold_init = true;
		}
		if (throttle < 1030) {
			yaw_hold_init = false;
			target_yaw = yaw;
		}
		if (throttle < 1300) {
			PID_Reset(&PID_Rate_Yaw);
			PID_Reset(&PID_Rate_Pitch);
			PID_Reset(&PID_Rate_Roll);
			PID_Reset(&PID_Angle);
		}
		mtf01_updated = MTF01_Update(&mtf_data);
		GPS_Process(&gps);
//		if (Mission_IsReady()) {
////			char tx_buf[30];
////			sprintf(tx_buf,"%d\r\n", Mission_GetCount() );
////			HAL_UART_Transmit(&huart7, tx_buf, strlen(tx_buf), 20);
//		}
		readIMU();
		calculateAngle(dt);
		Estimate_Position_GPS_Kalman(dt);
		PID_Task(dt);
		mixer();
		if (DWT_GetMicros() - ina219_timer > 500000) {
			float voltage = INA219_Read_Bus_Voltage(&hi2c2);
			if (voltage >= 0.0f) {
				txData.battery = voltage;
			}
			ina219_timer = DWT_GetMicros();
		}
		if (DWT_GetMicros() - esp_timer > 1000000) {
			static char tx_buf[64];
			sprintf(tx_buf, "POS,%.7f,%.7f\n", gps.latitude, gps.longitude);
			HAL_UART_Transmit_DMA(&huart7, (uint8_t*) tx_buf, strlen(tx_buf));
			esp_timer = DWT_GetMicros();
		}

		if (gps.fixType == 3 && gps.numSV > 20 && mission_running) // 3d fix and min 20 satelites
			HAL_GPIO_WritePin(GPIOB, GPIO_PIN_2, 1);
		else
			HAL_GPIO_WritePin(GPIOB, GPIO_PIN_2, 0);

//		time_dt = DWT_GetMicros() - start;
		while ((DWT_GetMicros() - start) < 2000)
			;
//
//		Serial_printf(&huart1, "dt=%.4f\r\n", time_dt);
//		if(time_dt > 2005)
//		{
//			Serial_printf(&huart1, "dt=%.4f\r\n", time_dt);
//			Serial_printf(&huart1, "dwt=%d\r\n", DWT_GetMicros());
//		}
	}
	/* USER CODE END 3 */
}

/**
 * @brief System Clock Configuration
 * @retval None
 */
void SystemClock_Config(void) {
	RCC_OscInitTypeDef RCC_OscInitStruct = { 0 };
	RCC_ClkInitTypeDef RCC_ClkInitStruct = { 0 };

	/** Configure the main internal regulator output voltage
	 */
	__HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE0);

	while (!__HAL_PWR_GET_FLAG(PWR_FLAG_VOSRDY)) {
	}

	/** Initializes the RCC Oscillators according to the specified parameters
	 * in the RCC_OscInitTypeDef structure.
	 */
	RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI
			| RCC_OSCILLATORTYPE_CSI;
	RCC_OscInitStruct.HSIState = RCC_HSI_ON;
	RCC_OscInitStruct.HSIDiv = RCC_HSI_DIV2;
	RCC_OscInitStruct.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;
	RCC_OscInitStruct.CSIState = RCC_CSI_ON;
	RCC_OscInitStruct.CSICalibrationValue = RCC_CSICALIBRATION_DEFAULT;
	RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
	RCC_OscInitStruct.PLL.PLLSource = RCC_PLL1_SOURCE_CSI;
	RCC_OscInitStruct.PLL.PLLM = 1;
	RCC_OscInitStruct.PLL.PLLN = 125;
	RCC_OscInitStruct.PLL.PLLP = 2;
	RCC_OscInitStruct.PLL.PLLQ = 4;
	RCC_OscInitStruct.PLL.PLLR = 2;
	RCC_OscInitStruct.PLL.PLLRGE = RCC_PLL1_VCIRANGE_2;
	RCC_OscInitStruct.PLL.PLLVCOSEL = RCC_PLL1_VCORANGE_WIDE;
	RCC_OscInitStruct.PLL.PLLFRACN = 0;
	if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK) {
		Error_Handler();
	}

	/** Initializes the CPU, AHB and APB buses clocks
	 */
	RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_SYSCLK
			| RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2 | RCC_CLOCKTYPE_PCLK3;
	RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
	RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
	RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;
	RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;
	RCC_ClkInitStruct.APB3CLKDivider = RCC_HCLK_DIV1;

	if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_5) != HAL_OK) {
		Error_Handler();
	}

	/** Configure the programming delay
	 */
	__HAL_FLASH_SET_PROGRAM_DELAY(FLASH_PROGRAMMING_DELAY_2);
}

/**
 * @brief GPDMA1 Initialization Function
 * @param None
 * @retval None
 */
static void MX_GPDMA1_Init(void) {

	/* USER CODE BEGIN GPDMA1_Init 0 */

	/* USER CODE END GPDMA1_Init 0 */

	/* Peripheral clock enable */
	__HAL_RCC_GPDMA1_CLK_ENABLE();

	/* GPDMA1 interrupt Init */
	HAL_NVIC_SetPriority(GPDMA1_Channel0_IRQn, 0, 0);
	HAL_NVIC_EnableIRQ(GPDMA1_Channel0_IRQn);
	HAL_NVIC_SetPriority(GPDMA1_Channel1_IRQn, 0, 0);
	HAL_NVIC_EnableIRQ(GPDMA1_Channel1_IRQn);

	/* USER CODE BEGIN GPDMA1_Init 1 */

	/* USER CODE END GPDMA1_Init 1 */
	/* USER CODE BEGIN GPDMA1_Init 2 */

	/* USER CODE END GPDMA1_Init 2 */

}

/**
 * @brief GPDMA2 Initialization Function
 * @param None
 * @retval None
 */
static void MX_GPDMA2_Init(void) {

	/* USER CODE BEGIN GPDMA2_Init 0 */

	/* USER CODE END GPDMA2_Init 0 */

	/* Peripheral clock enable */
	__HAL_RCC_GPDMA2_CLK_ENABLE();

	/* GPDMA2 interrupt Init */
	HAL_NVIC_SetPriority(GPDMA2_Channel0_IRQn, 0, 0);
	HAL_NVIC_EnableIRQ(GPDMA2_Channel0_IRQn);
	HAL_NVIC_SetPriority(GPDMA2_Channel1_IRQn, 0, 0);
	HAL_NVIC_EnableIRQ(GPDMA2_Channel1_IRQn);

	/* USER CODE BEGIN GPDMA2_Init 1 */

	/* USER CODE END GPDMA2_Init 1 */
	/* USER CODE BEGIN GPDMA2_Init 2 */

	/* USER CODE END GPDMA2_Init 2 */

}

/**
 * @brief I2C1 Initialization Function
 * @param None
 * @retval None
 */
static void MX_I2C1_Init(void) {

	/* USER CODE BEGIN I2C1_Init 0 */

	/* USER CODE END I2C1_Init 0 */

	/* USER CODE BEGIN I2C1_Init 1 */

	/* USER CODE END I2C1_Init 1 */
	hi2c1.Instance = I2C1;
	hi2c1.Init.Timing = 0x60808CD3;
	hi2c1.Init.OwnAddress1 = 0;
	hi2c1.Init.AddressingMode = I2C_ADDRESSINGMODE_7BIT;
	hi2c1.Init.DualAddressMode = I2C_DUALADDRESS_DISABLE;
	hi2c1.Init.OwnAddress2 = 0;
	hi2c1.Init.OwnAddress2Masks = I2C_OA2_NOMASK;
	hi2c1.Init.GeneralCallMode = I2C_GENERALCALL_DISABLE;
	hi2c1.Init.NoStretchMode = I2C_NOSTRETCH_DISABLE;
	if (HAL_I2C_Init(&hi2c1) != HAL_OK) {
		Error_Handler();
	}

	/** Configure Analogue filter
	 */
	if (HAL_I2CEx_ConfigAnalogFilter(&hi2c1, I2C_ANALOGFILTER_ENABLE)
			!= HAL_OK) {
		Error_Handler();
	}

	/** Configure Digital filter
	 */
	if (HAL_I2CEx_ConfigDigitalFilter(&hi2c1, 0) != HAL_OK) {
		Error_Handler();
	}
	/* USER CODE BEGIN I2C1_Init 2 */

